app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.location_one = params[:location_one]
    @post.location_two = params[:location_two]
    @post.start_date =  params[:start_date]
    @post.end_date = params[:end_date]
    @post.welfare = params[:welfare]
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "gdg"], ["content", "gdgd"], ["user_id", 1], ["created_at", "2018-11-07 16:02:02.453347"], ["updated_at", "2018-11-07 16:02:02.453347"]]

  def update
    authorize_action_for @post
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "<p><strong>ㄴㅁㄴㅇㄻㄴ</strong></p>\r\n<p><strong>ㅁㄴㅇㄹsfgㅁ</strong></p>"], ["updated_at", "2018-11-08 08:12:38.277331"], ["id", 1]]